// 1) Напишите условие if для проверки, что переменная age находится в диапазоне между 14 и 90 включительно.
//«Включительно» означает, что значение переменной age может быть равно 14 или 90.

// let age = prompt("Введите ваш возраст");

// if (age >= 14 && age < 90) {
//     alert('Проверка прошла успешно');
// }else{
//     alert('Проверка не прошла')
// }

// 2) Выберите правильный логический оператор в следующем выражении, чтобы в результате было отображено значение переменной b.
//let a = "", b = 7, c = 1, d = 2; 
//alert( a || c /*логический оператор(выберите правильный вариант)*/ b || d );

// let a = "", b = 7, c = 1, d = 2;
// alert( a || c && b || d );

//3) Напишите условие, которая принимает 2 переменные: age (возраст) и hasLicense (есть ли у человека водительские права).
//Условие должно возвращать true, если человеку уже исполнилось 18 лет и у него есть водительские права, и false в противном случае.


// let people = {
//     age: prompt('Ваш возраст'),
//     hasLicense: prompt('У вас имеются водительские права?')
// }

// if (people.age >= 18 && people.hasLicense == 'Да' || 'да') {
//     alert('Прошел')
// } else {
//     alert('Не прошел')
// }


//4) Создайте переменную age и присвойте ей значение вашего возраста.Создайте условие, которое проверяет, 
//является ли ваш возраст либо меньше 18, либо больше 65. Если условие истинно, выведите сообщение в консоль о том, 
//что вы либо слишком молоды, либо вам нужно отдыхать и не писать код. 
//Если условие ложно, выведите сообщение о том, что ваш возраст подходит для выполнения этой задачи.

// let age = 17

// if (age < 18) {
//     console.log('Вы слишком молоды');
// }else if( age > 65){
//     console.log('Вам нужно отдохнуть');
// }
//  else {
//     console.log('возраст подходит для выполнения этой задачи');
// }

// Полностью не понял тему :O









